updated to mermaid
